function astro(){
    let day=document.getElementById("day").value
    let month=document.getElementById("month").value
    let zodii=document.getElementById("zodii")
    console.log(day)
    console.log(month)
    day=parseInt(day)

    let astro_sign="";
    let astro_info="";



            if(!day){return}

            if (month == "декември"){

                if (day < 22)
                astro_sign = "Стрелец";
                else
                astro_sign ="Козирог";
            }

            else if (month == "януари"){
                if (day < 20)
                astro_sign = "Козирог";
                else
                astro_sign = "Водолей";
            }

            else if (month == "февруари"){
                if (day < 19)
                astro_sign = "Водолей";
                else
                astro_sign = "Риби";
            }

            else if(month == "март"){
                if (day < 21)
                astro_sign = "Риби";
                else
                astro_sign = "Овен";
            }
            else if (month == "април"){
                if (day < 20)
                astro_sign = "Овен";
                else
                astro_sign = "Телец";
            }

            else if (month == "май"){
                if (day < 21)
                astro_sign = "Телец";
                else
                astro_sign = "Близнаци";
            }

            else if( month == "юни"){
                if (day < 21)
                astro_sign = "Близнаци";
                else
                astro_sign = "Рак";
            }

            else if (month == "юли"){
                if (day < 23)
                astro_sign = "Рак";
                else
                astro_sign = "Лъв";
            }

            else if( month == "август"){
                if (day < 23)
                astro_sign = "Лъв";
                else
                astro_sign = "Дева";
            }

            else if (month == "септември"){
                if (day < 23)
                astro_sign = "Дева";
                else
                astro_sign = "Везна";
            }

            else if (month == "октомври"){
                if (day < 23)
                astro_sign = "Везна";
                else
                astro_sign = "Скорпион";
            }

            else if (month == "ноември"){
                if (day < 22)
                astro_sign = "Скорпион";
                else
                astro_sign = "Стрелец";
            }
            switch(astro_sign){
                case "Козирог":
                    astro_info="-Козирозите са най-добрите мениджъри. Те са родени лидери, въпреки че самите те понякога не го забелязват.  В никакъв случай не спорете с Козирога. Съгласете се с всичко, което той казва. Често този знак има проблеми със съня заради постоянните си тревожни мисли."
                    break
                case "Риби":
                    astro_info="-Всеизвестен факт е, че Рибите са творчески личности, но на малцина е известно, че сред тях са най-добрите художници. Голяма част от представителите на този знак са нощни птици. За разлика от останалите хора те лесно преодоляват страха си от тъмнината. Това важи най-вече за дамите."
                    break
                case "Овен":
                    astro_info="-Представителите на този знак са по-склонни от останалите към пристрастяване. Те са готови да похарчат и последната си стотинка за пътешествия."
                    break
                case "Стрелец":
                astro_info="- Стрелецът притежава невероятна сила и оптимизъм. Никой не може да се сравни с него в това отношение. Сред представителите на този знак има огромен брой талантливи журналисти. Те са най-големите авантюристи. Споделете страстта им и тогава просто ще започнат да ви обожават"
                break
                case "Дева":
                    astro_info="-Мъжете и жените от този знак са коренно различни един от друг. Мъжът и жената от тази зодия имат най-лошата съвместимост. Девите са много нервни. Изнервят се дори без причина. Те просто харесват реда. Но са най-учтивите хора."
                    break
                case "Близнаци":
                    astro_info="-Хората от този знак не могат да живеят без драма. В случай, че тя не е във връзката им, тогава те ще сложат край на отношенията си с партньора. Ако искате да запазите връзката си с представител на зодия Близнаци, постоянно комуникирайте с него."
                    break
                case "Водолей":
                astro_info="- Голяма част от гениални учени са именно сред Водолеите. Този факт е известен на малцина, но е истина. Водолеите са най-привлечени от тези, които могат да ги подкрепят. Те също рядко създават връзки с тези, които не споделят техните страсти. Водолеите обичат да поспиват повече от останалите."
                break
                case "Скорпион":
                    astro_info="-Скорпионите са най-добрите следователи и детективи в зодиака. Изключително трудно е да се обичат представителите на този знак, въпреки че връзката с тях се помни дълго."
                    break
                case "Везна":
                    astro_info="- Везните са най-страстните любовници. Ревността и завистта са им чужди. Те мразят шумните и придирчиви хора, въпреки че често намират общ език дори с тях."
                    break
                case "Лъв":
                astro_info="-Лъвовете са най-гордите, но и най-лоялните. Вероятността те да успеят да променят другите е минимална. "
                break
                case "Рак":
                    astro_info="-Ракът има невероятни кулинарни умения. Но повече от всичко той се страхува от самотата, въпреки че определено никога няма да сподели това. Раците имат най-мощната интуиция, но по някаква причина не говорят за нея."
                    break
                case "Телец":
                    astro_info="-Телецът обича красите дрехи. Той харчи много, за да изглежда по-добре от другите. Хората от този знак правят най-красивите подаръци. Друг интересен факт е, че те се страхуват от високото."
                    break
                
            }
            /*let astro_signH1Tag = document.createElement('h1')
            astro_signH1Tag.innerText = `Твоя зодиакален знак е:${astro_sign}`
            astro_signH1Tag.setAttribute('id','zodii')
                
            document.body.appendChild(astro_signH1Tag)*/
            zodii.innerText = `Твоят зодиакален знак е:${astro_sign}${astro_info}`

    }